docs: update class diagram
